"""
Еден градски блок се соочува со опасно високи температури поради одбивање на сончевата светлина од блиските згради.
Одредени точки стануваат екстремно жешки и небезбедни. За да ги заштитите пешаците, треба да поставите чадори за
сонце така што сите опасни точки ќе бидат покриени. Дадена ви е област со големина 10 × 10 и N опасни точки прочитани
од влезот, секоја со координати (x_i, y_i). Можете да поставите најмногу M чадори, секој претставен како круг со
фиксен радиус R, каде M и R се читаат од влезот. Секој чадор е дефиниран со координатите на неговиот центар. Не мора
да ги користите сите чадори. Целта е да се покријат сите опасни точки користејќи што е можно помалку чадори, при што
се минимизира преклопувањето на чадорите и се осигурува дека чадорите остануваат во рамките на градскиот блок.
Точка се смета за покриена ако нејзиното растојание до барем еден центар на чадор е помало од радиусот R.
Чадорите МОРА целосно да се наоѓаат во рамките на градскиот блок. Не смее да постои решение/хромозом каде дел од
чадорот е надвор од мрежата. Нека d е растојанието помеѓу два центри на чадори. Велиме дека:
    нема преклопување ако d е поголемо од 2R;
    има големо преклопување ако d е помало од 8R/5;
    има мало преклопување во останатиот случај.
Дел 1:
Дополнете делови од дадениот почетен код. Не ги менувајте останатите параметри. Дефинирајте соодветен gene space за
овој проблем за секој тест пример. (Размислете за валиден начин за кодирање на решенијата). Дизајнирајте decode
функција која како влез прима решение/хромозом, а како излез враќа листа од торки со координати на центрите на
искористените чадори. Поточно, вратете [(x1, y1), (x2, y2), ...]. Дизајнирајте fitness функција која ги следи
следниве принципи:
    Непокриени точки → многу голема казна
    Големи преклопувања → голема казна
    Мали преклопувања → казна 10× помала од големото преклопување
    Број на искористени чадори → мала казна (се поттикнува користење на помал број чадори)
Валидно решение кое ги покрива сите точки, секогаш треба да биде подобро од кое било друго кое остава непокриени точки.
Дел 2:
Во овој дел строго ќе работиме само со следниот влез:
3 3 1  # N M R
1 1
1.1 1
5 5
Конструирајте листа од 5 пример хромозоми подредени во растечки редослед според квалитетот на fitness функцијата.
Вашите примери треба да бидат избрани така што ќе ги демонстрираат специфичните аспекти на fitness функцијата
(непокриени точки, преклопувања, број на искористени чадори). На крај, предадете ја fitness функцијата, decode
функцијата, пример хромозомите и најдобрите хромозоми од секоја генерација до grader-от. Внимавајте на fitness и
decode функциите, тие треба да работат со хромозоми од различни должини, оние од тест примерите, како и пример
хромозомите кои вие ги дефинирате.
"""
import math
from copyreg import dispatch_table

import pygad

N, M, R = map(float, input().split())  # R е фиксен радиус на точките
N = int(N)  # број на опасни точки
M = int(M)  # број на чадори кои може да се постават

points = [tuple(map(float, input().split())) for _ in range(N)]  # опасните точки, листа од торки


# Part 1.

def dist(cador1, cador2):  # ((x1,y1), (x2,y2))
    distance = math.dist(cador1, cador2)
    return distance


def decode(solution):
    # solution = [1, X0, Y0, 0, X1, Y1, 0, X2, Y2, 1, X3, Y3,...] -> [(X0,Y0), (X1,Y1), (X2,Y2), (X3,Y3),...]
    outLista = []
    for i in range(0, len(solution), 3):
        if solution[i] == 1:
            outLista.append((solution[i + 1], solution[i + 2]))
    return outLista


def fitness_func(ga, solution, idx):
    listaCadori = decode(solution)  # [(X0,Y0), (X1,Y1), (X2,Y2), (X3,Y3),...]
    # points = [(X0,Y0), (X1,Y1), (X2,Y2), (X3,Y3),...]

    # 1. Непокриени точки → многу голема казна
    # 2. Големи преклопувања → голема казна
    # 3. Мали преклопувања → казна 10× помала од големото преклопување
    # 4. Број на искористени чадори → мала казна
    # 5. Решение кое ги покрива сите точки, секогаш треба да биде подобро од друго кое остава непокриени точки.

    fitnessValue = 0
    pokrieniSiteTocki = True

    # 1.
    for tocka in points:
        flag = False
        for cador in listaCadori:
            distTockaCador = dist(cador, tocka)
            if distTockaCador <= R:
                flag = True
                break
        if flag == False:
            fitnessValue -= 10000
            pokrieniSiteTocki = False

    # нема преклопување ако d е поголемо од 2R;
    # има големо преклопување ако d е помало од 8R/5;  ->  golema kazna
    # има мало преклопување во останатиот случај.  ->  10x pomala kazna od golemoto preklopuvanje

    # 2 и 3.
    for i in range(0, len(listaCadori)):
        for j in range(i + 1, len(listaCadori)):
            distance = dist(listaCadori[i], listaCadori[j])
            if distance < (8 * R) / 5:
                fitnessValue -= 1000
            elif distance <= 2 * R and distance >= (8 * R) / 5:
                fitnessValue -= 100

    # 4.
    fitnessValue -= len(listaCadori)

    return fitnessValue


gene_space = []
for i in range(0, M):
    gene_space.append([0, 1])
    gene_space.append({'low': R, 'high': 10 - R})
    gene_space.append({'low': R, 'high': 10 - R})

params = {
    'num_generations': 500,
    'sol_per_pop': 100,
    'num_parents_mating': 50,

    'num_genes': M * 3,
    'gene_space': gene_space,

    'fitness_func': fitness_func,

    'mutation_num_genes': 1,
    'save_best_solutions': True
}

ga = pygad.GA(**params)

ga.run()

solution, _, _ = ga.best_solution()
fitness = fitness_func(None, solution, 0)
best_solutions = ga.best_solutions

print(solution)
print(fitness)
